---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewPrintingEventArgs.View
zh: 视图
source: html/b8d78c0e-31c4-0060-60a7-fb76f92da1bc.htm
---
# Autodesk.Revit.DB.Events.ViewPrintingEventArgs.View Property

**中文**: 视图

The view to be printed.

## Syntax (C#)
```csharp
public View View { get; }
```